{
    "sci": [
        "Neelakandan, S & Paulraj, D 2020, ‘A gradient boosted decision tree-based sentiment classification of twitter data’, International Journal of Wavelets, Multiresolution and Information Processing, vol. 18, no. 4, pp. 205027 1-21. DOI: https://doi. org/10.1142/ S0219691320500277 ",
        "Neelakandan, S & Paulraj, D 2020, ‘An Automated Exploring And Learning Model For Data Prediction Using Balanced CA-SVM’, Journal of Ambient Intelligence and Humanized Computing, Vol.12 ,no.5, April 2020 , DOI: https://doi. org/10.1007/ s12652-020-01937-9",
        "Neelakandan, S & Paulraj, D 2020, ‘An Automated Learning Model for Sentiment Analysis and Data Classification of Twitter Data Using Balanced CA-SVM’, Concurrent Engineering Research and Applications, Vol.29, No.4, pp 386-395, DOI: https://doi. org/10.1177/1063293X20915307",
        "Neelakandan, S., Berlin, M.A., Tripathi, S. et al. IoT-based traffic prediction and traffic signal control system for smart city. Soft Computing (2021). https://doi.org/10.1007/s00500-021-05896-x",
        "R. Kamalraj, S. Neelakandan, M. Ranjith Kumar, V. Chandra Shekhar Rao, Rohit Anand, Harinder Singh, Interpretable filter based convolutional neural network (IF-CNN) for glucose prediction and classification using PD-SS algorithm, Measurement, Vol.183,2021, https://doi.org/10.1016/j.measurement.2021.109804.",
        "Kavitha, T., Mathai, P.P., Karthikeyan, C. et al. Deep Learning Based Capsule Neural Network Model for Breast Cancer Diagnosis Using Mammogram Images. Interdiscip Sci Comput Life Sci (2021). https://doi.org/10.1007/s12539-021-00467-y",
        "C Pretty Diana Cyril, J Rene Beulah, Neelakandan Subramani, Prakash Mohan, A Harshavardhan, D Sivabalaselvamani, An automated learning model for sentiment analysis and data classification of Twitter data using balanced CA-SVM, Concurrent Engineering Research and Applications,Vol.29,No.4,pp 386-395.",
        "Reshma, G., Al-Atroshi, C., Nassa, V. K., Geetha, B., Neelakandan.S. et al. (2022). Deep Learning-Based Skin Lesion Diagnosis Model Using Dermoscopic Images. Intelligent Automation & Soft Computing, vol.31,no.1, pp.621–634.",
        "Neelakandan, S., Arun, A., Bhukya, R. R., Hardas, B. M., Ch., T. et al. (2022). An Automated Word Embedding with Parameter Tuned Model for Web Crawling. Intelligent Automation & Soft Computing, 32(3), 1617–1632.",
        "P. Asha, L. Natrayan, B.T. Geetha, J. Rene Beulah, R. Sumathy, G. Varalakshmi, S. Neelakandan, IoT enabled environmental toxicology for air pollution monitoring using AI techniques, Environmental Research, Volume 205, 2022, 112574, https://doi.org/10.1016/j.envres.2021.112574.",
        "D. Venu, A.V.R. Mayuri, S. Neelakandan, G.L.N. Murthy, N. Arulkumar, Nilesh Shelke, An efficient low complexity compression based optimal homomorphic encryption for secure fiber optic communication, Optik, Vol 252,2022,pp.168545, https://doi.org/10.1016/j.ijleo.2021.168545",
        "D. K. Jain, S. K. S. Tyagi, S. Neelakandan, M. Prakash and L. Natrayan, Metaheuristic Optimization-Based Resource Allocation Technique for Cybertwin-Driven 6G on IoE Environment, IEEE Transactions on Industrial Informatics, vol. 18, no. 7, pp. 4884-4892, July 2022, doi: 10.1109/TII.2021.3138915.",
        "Subramani, Neelakandan, Prakash Mohan, Youseef Alotaibi, Saleh Alghamdi, and Osamah I. Khalaf. 2022. An Efficient Metaheuristic-Based Clustering with Routing Protocol for Underwater Wireless Sensor Networks Sensors 22, no. 2: 415. https://doi.org/10.3390/s22020415",
        "Gurram Sunitha, K. Geetha, S. Neelakandan, Aditya Kumar Singh Pundir, S. Hemalatha, Vinay Kumar, Intelligent deep learning-based Clustring and classification using facial images, Image and Vision Computing, Vol. 121,2022, https://doi.org/10.1016/j.imavis.2022.104404.",
        "Mohan.P, Subramani, N.; Alotaibi, Y.; Alghamdi, S.; Khalaf, O.I.; Ulaganathan, S. Improved Metaheuristics-Based Clustering with Multihop Routing Protocol for Underwater Wireless Sensor Networks. Sensors 2022, 22, 1618. https://doi.org/10.3390/s22041618",
        "Harinder Singh, D. Ramya, R. Saravanakumar, Nayani Sateesh, Rohit Anand, Swarnjit Singh, S. Neelakandan, Artificial intelligence based quality of transmission predictive model for cognitive optical networks, Optik, Vol. 257, 2022,https://doi.org/10.1016/j.ijleo.2022.168789.",
        "Anuradha, D.; Subramani, N.; Khalaf, O.I.; Alotaibi, Y.; Alghamdi, S.; Rajagopal, M. Chaotic Search-and-Rescue-Optimization-Based Multi-Hop Data Transmission Protocol for Underwater Wireless Sensor Networks. Sensors 2022, 22, 2867. https://doi.org/10.3390/s22082867.",
        "B.T. Geetha, P. Santhosh Kumar, B. Sathya Bama, S. Neelakandan, Chiranjit Dutta, D. Vijendra Babu, Green energy aware and cluster-based communication for future load prediction in IoT, Sustainable Energy Technologies and Assessments, Vol.52,2022,102244, https://doi.org/10.1016/j.seta.2022.102244.",
        "A. Harshavardhan, Prasanthi Boyapati, S. Neelakandan, Alhassan Alolo Abdul-Rasheed Akeji, Aditya Kumar Singh Pundir, Ranjan Walia, LSGDM with Biogeography-Based Optimization (BBO) Model for Healthcare Applications, Journal of Healthcare Engineering, vol. 2022, Article ID 2170839, 11 pages, 2022. https://doi.org/10.1155/2022/2170839",
        "S. Parthiban, A. Harshavardhan, S. Neelakandan, Vempaty Prashanthi, Abdul-Rasheed Akeji Alhassan Alolo, S. Velmurugan, Chaotic Salp Swarm Optimization-Based Energy-Aware VMP Technique for Cloud Data Centers, Computational Intelligence and Neuroscience, vol. 2022, Article ID 4343476, 9 pages, 2022. https://doi.org/10.1155/2022/4343476",
        "M. Kavitha, B. Sankara Babu, B. Sumathy, T. Jackulin, N. Ramkumar et al., Convolutional neural networks-based video reconstruction and computation in digital twins, Intelligent Automation & Soft Computing, vol. 34, no.3, pp. 1571–1586, 2022.",
        "S.Raghavendar,A.Hardhavardhan,S.Neelakandan,R.Partheepan,Ranjan Walia and V.Chandra Shekar Rao, Multilayer Stacked Probabilistic Belief Network-Based Brain Tumor Segmentation and Classification “International Journal of Foundations of Computer Science”, https://doi.org/10.1142/S0129054122420047",
        "Neelakandan S, Perumal SK, Kallimani JS, Ulaganathan S, Bhargava S, Meckanizi S. Controlling energy aware clustering and multihop routing protocol for IoT assisted wireless sensor networks. Concurrency Computat Pract Exper. 2022;e7106. doi: 10.1002/cpe.710",
        "Neelakandan S, Sridevi M, Saravanan Chandrasekaran, Murugeswari, Bheema Lingaiah, Deep Learning Approaches for Cyberbullying Detection and Classification on Social Media, Computational Intelligence and Neuroscience, vol. 2022, 2022. https://doi.org/10.1155/2022/2163458",
        "Deepak Kumar Jain, S. Neelakandan, T. Veeramani, Surbhi Bhatia, Fida Hussain Memon, Design of fuzzy logic-based energy management and traffic predictive model for cyber physical systems, Computers and Electrical Engineering, Vol 102,2022,108135, https://doi.org/10.1016/j.compeleceng.2022.108135",
        "Lakshmanna, K.; Subramani, N.; Alotaibi, Y.; Alghamdi, S.; Khalafand, O.I.; Nanda, A.K. Improved Metaheuristic-Driven Energy-Aware Cluster-Based Routing Scheme for IoT-Assisted Wireless Sensor Networks. Sustainability 2022, 14, 7712. https://doi.org/10.3390/su14137712",
        "Neelakandan S, D. Paulraj, P. Ezhumalai & M. Prakash (2022) A Deep Learning Modified Neural Network(DLMNN) based proficient sentiment analysis technique on Twitter data, Journal of Experimental & Theoretical Artificial Intelligence, DOI: 10.1080/0952813X.2022.2093405",
        "Keshetti Sreekala, C. Pretty Diana Cyril, S. Neelakandan, Saravanan Chandrasekaran, Ranjan Walia, Eric Ofori Martinson, Capsule Network-Based Deep Transfer Learning Model for Face Recognition, Wireless Communications and Mobile Computing, vol. 2022, https://doi.org/10.1155/2022/2086613",
        "S. Neelakandan, Ahmed Mohammed Metwally, Madhappan Santhamoorthy, M. Satyanarayana Gupta, Metaheuristics with Deep Transfer Learning Enabled Detection and classification model for industrial waste management, Chemosphere, 2022, 136046, https://doi.org/10.1016/j.chemosphere.2022.136046",
        "Deepak Kumar Jain, Xue Liu, Subramani Neelakandan, and Mohan Prakash Modeling of human action recognition using hyperparameter tuned deep learning model, Journal of Electronic Imaging 32(1), 011211 (14 September 2022). https://doi.org/10.1117/1.JEI.32.1.011211",
        "J. Faritha Banu, S. Neelakandan, B.T Geetha, V. Selvalakshmi, A. Umadevi, Eric Ofori Martinson, Artificial Intelligence Based Customer Churn Prediction Model for Business Markets, Computational Intelligence and Neuroscience, vol. 2022, 2022. https://doi.org/10.1155/2022/1703696",
        "Raghavendra S, S. Neelakandan, M. Prakash, B.T. Geetha, S. Mary Rexcy Asha, Michaelraj Kingston Roberts, Artificial Humming Bird with Data Science Enabled Stability Prediction Model for Smart Grids, Sustainable Computing: Informatics and Systems, vol.36,2022,https://doi.org/10.1016/j.suscom.2022.100821",
        "Awari, H., Subramani, N., Janagaraj, A., Balasubramaniapillai Thanammal, G., Thangarasu, J., & Kohar, R. (2022). Three-dimensional dental image segmentation and classification using deep learning with tunicate swarm algorithm. Expert Systems, e13198. https://doi.org/10.1111/exsy.13198",
        "Gangathimmappa, M, Subramani, N, Sambath, V, Ramanujam, RAM, Sammeta, M. Deep learning enabled cross-lingual search with metaheuristic web-based query optimization model for multi-document summarization. Concurrency Computation Practice Experience. 2022;e7476. doi:10.1002/cpe.7476",
        "Shanmugavadivel, K., Sathishkumar, V.E., Neelakandan.S. et al. Deep learning based sentiment analysis and offensive language identification on multilingual code-mixed data. Sci Rep 12, 21557 (2022). https://doi.org/10.1038/s41598-022-26092-3",
        "Mohan,P.; Veerappampalayam Easwaramoorthy, S.; Subramani, N.; Subramanian, M.; Meckanzi, S. Handcrafted Deep-Feature-Based Brain Tumor Detection and Classification Using MRI Images. Electronics 2022, 11, 4178. https://doi.org/10.3390/electronics11244178",
        "Arul Vinyaakam Rajasimman M, Manoharan RK, Subramani N, Aridoss M, Galety MG. Robust Facial Expression Recognition Using An Evolutionary Algorithm with a Deep Learning Model. Applied Sciences. 2023; 13(1):468. https://doi.org/10.3390/app13010468",
        "Zhenwei Zhao, Xiaoming Li, Bing Luan, Weining Jiang, Weidong Gao, Subramani Neelakandan, Secure Internet of Things (IoT) using a Novel Brooks Iyengar Quantum Byzantine Agreement-centered blockchain Networking (BIQBA-BCN) Model in Smart Healthcare, Information Sciences, 2023,https://doi.org/10.1016/j.ins.2023.01.020.",
        "Alharbi, M., Neelakandan, S., Gupta, S. et al. Mobility aware load balancing using Kho–Kho optimization algorithm for hybrid Li-Fi and Wi-Fi network. Wireless Networks (2023). https://doi.org/10.1007/s11276-022-03225-0",
        "Neelakandan Subramani, Abbas Mardani, Prakash Mohan, Arunodaya Raj Mishra, Ezhumalai P. A fuzzy logic and DEEC protocol-based clustering routing method for wireless sensor networks[J]. AIMS Mathematics, 2023, 8(4): 8310-8331. doi: 10.3934/math.2023419",
        "Saravanan, G., Neelakandan, S., Ezhumalai, P. et al. Improved wild horse optimization with levy flight algorithm for effective task scheduling in cloud computing. J Cloud Comp 12, 24 (2023). https://doi.org/10.1186/s13677-023-00401-1",
        "Prakash Mohan, S. Neelakandan, Abbas Mardani, Sudhanshu Maurya & N. Arulkumar (2023) Eagle Strategy Arithmetic Optimisation Algorithm with Optimal Deep Convolutional Forest Based FinTech Application for Hyper-automation,  Enterprise Information Systems, DOI: 10.1080/17517575.2023.2188123",
        "Paulraj D, Sethukarasi T, Neelakandan S, Prakash M, Baburaj E (2023) An Efficient Hybrid Job Scheduling Optimization (EHJSO) approach to enhance resource search using Cuckoo and Grey Wolf Job Optimization for cloud environment. PLOS ONE 18(3): e0282600. https://doi.org/10.1371/journal.pone.0282600",
        "S Neelakandan, NV Reddy, AA Ghfar, S Pandey, S Kiran, P Thillai Arasu, Internet of things with nanomaterials-based predictive model for wastewater treatment using stacked sparse denoising auto-encoder, Water Reuse, https://doi.org/10.2166/wrd.2023.006",
        "DK Jain, S Neelakandan, A Vidyarthi, D Gupta, Deep learning-based intelligent system for fingerprint identification using decision-based median filter, Pattern Recognition Letters 174, 25-31",
        "S Deepa, A Umamageswari, S Neelakandan, H Bhukya, Deep Belief Network-Based User and Entity Behavior Analytics (UEBA) for Web Applications, International Journal of Cooperative Information Systems, 2350016, https://doi.org/10.1142/S0218843023500168",
        "M Prakash, S Neelakandan, M Tamilselvi, S Velmurugan, Deep Learning-Based Wildfire Image Detection and Classification Systems for Controlling Biomass, International Journal of Intelligent Systems, Vol.2023, https://doi.org/10.1155/2023/7939516",
        "FD Shadrach, G Kandasamy, S Neelakandan, TB Lingaiah, Optimal transfer learning based nutrient deficiency classification model in ridge gourd (Luffa acutangula), Scientific Reports 13 (1), 14108",
        "D Paulraj, S Neelakandan, M Prakash, E Baburaj, Admission control policy and key agreement based on anonymous identity in cloud computing, Journal of Cloud Computing 12 (1), 71.",
        "S Neelakandan, SV Easwaramoorthy, A Chinnasamy, J Cho, Fuzzy adaptive learning control network (FALCN) for image clustering and content-based image retrieval on noisy dataset, AIMS Mathematics 8 (8), 18314-18338",
        "Xu, Z., Jain, D.K., Neelakandan, S. et al. Hunger games search optimization with deep learning model for sustainable supply chain management. Discov Internet Things 3, 10 (2023). https://doi.org/10.1007/s43926-023-00040-7",
        "Menaka, S.R., Prakash, M., Neelakandan, S. et al. A novel WGF-LN based edge driven intelligence for wearable devices in human activity recognition. Sci Rep 13, 17822 (2023). https://doi.org/10.1038/s41598-023-44213-4",
        "D. Paulraj, K.A. Mohamed Junaid, T. Sethukarasi, M. Vigilson Prem, Adi Alhudhaif, Norah Alnaim, A novel efficient Rank-Revealing QR matrix and Schur decomposition method for big data mining and clustering (RRQR-SDM),Information Sciences, Vol.657, 2024, https://doi.org/10.1016/j.ins.2023.119957."
    ],
    "scopus": [
        "Neelakandan, S, Annamalai, R., Rayen, S. J., & Arunajsmine, J. (2020). Social Media Networks Owing to Disruptions For Effective Learning. Procedia Computer Science, Vol.172, pp.145–151. doi:10.1016/j.procs.2020.05.022",
        "S. Neelakandan and J. Gokul Anand, 'Trust based optimal routing in MANET's,' 2011 International Conference on Emerging Trends in Electrical and Computer Technology, Nagercoil, India, 2011, pp. 1150-1156, doi: 10.1109/ICETECT.2011.5760293.",
        "S.Divyabharathi,“Large scale optimization to minimize network traffic using MapReduce in big data applications”. International Conference on Computation of Power, Energy Information and Communication (ICCPEIC), pp. 193-199, April 2016. DOI : 10.1109/ICCPEIC.2016.7557196",
        "Itnal, S., Kannan, K.S., Suma, K.G., Neelakandan, S. (2022). A Secured Healthcare Medical System Using Blockchain Technology. In: Kumar, A., Mozar, S. (eds) ICCCE 2021. Lecture Notes in Electrical Engineering, vol 828. Springer, Singapore. https://doi.org/10.1007/978-981-16-7985-8_17",
        "S.Neelakandan, J. Rene Beulah,L.Prathiba, G.L.N Murthy, E. Fantin Irudaya Raj and N. Arulkumar ,” Blockchain with deep learning-enabled secure healthcare data transmission and diagnostic model”, International Journal of Modeling, Simulation, and Scientific Computing, https://doi.org/10.1142/S1793962322410069",
        "S. Neelakandan, S., Prakash, M., Bhargava, S., Mohan, K., Robert, N.R., Upadhye, S. (2022). Optimal Stacked Sparse Autoencoder Based Traffic Flow Prediction in Intelligent Transportation Systems. Studies in Systems, Decision and Control, vol 412. Springer, Cham. https://doi.org/10.1007/978-3-030-94102-4_6",
        "Siripuri Kiran, S. Neelakandan, A. Pratapa Reddy, Sonali Goyal, Balajee Maram, V. Chandra Shekhar Rao, Chapter 11 - Internet of things and wearables-enabled Alzheimer detection and classification model using stacked sparse autoencoder, Wearable Telemedicine Technology for the Healthcare Industry, Academic Press,2022, pp 153-168,https://doi.org/10.1016/B978-0-323-85854-0.00012-5.",
        "S.Neelakandan, K Keerthika, P Ilanchezhian, TS Madeswaran ,Quantum Invasive Weed Optimization Based Energy Aware Task Scheduling For Cyber–Physical System Environment , International Journal of Modeling, Simulation, and Scientific Computing, https://doi.org/10.1142/S1793962323410167",
        "P. Ravi Prakash, D. Anuradha, Javid Iqbal, Mohammad Gouse Galety, Ruby Singh & S. Neelakandan (2022) A novel convolutional neural network with gated recurrent unit for automated speech emotion recognition and classification, Journal of Control and Decision, DOI: 10.1080/23307706.2022.2085198",
        "Chiai AI-Atroshi, J. Rene Beulah, Kranthi Kumar Singamaneni, C. Pretty Diana Cyril, S. Neelakandan & S. Velmurugan (2022) Automated speech based evaluation of mild cognitive impairment and Alzheimer’s disease detection using with deep belief network model, International Journal of Healthcare Management, DOI: 10.1080/20479700.2022.2097764.",
        "Sachin Upadhye, S. Neelakandan, K. Thangaraj, D. Vijendra Babu, N. Arulkumar, Kashif Qureshi,” Modeling of Real Time Traffic Flow Monitoring System Using Deep Learning and Unmanned Aerial Vehicles”, Journal of Mobile Multimedia,Vol.19,No.2,2023,doi.org/10.13052/jmm1550-4646.1926",
        "PR Prakash, D Anuradha, J Iqbal, MG Galety, R Singh, S Neelakandan, A novel convolutional neural network with gated recurrent unit for automated speech emotion recognition and classification, Journal of Control and Decision 10 (1), 54-63",
        "Subramani, N.; Veerappampalayam Easwaramoorthy, S.; Mohan, P.; Subramanian, M.; Sambath, V. A Gradient Boosted Decision Tree-Based Influencer Prediction in Social Network Analysis. Big Data Cogn. Comput. 2023, 7, 6. https://doi.org/10.3390/bdcc7010006s",
        "AK Nanda, S Gupta, ALM Saleth, S Kiran,Neelakandan.S, Multi-layer perceptron's neural network with optimization algorithm for greenhouse gas forecasting systems, Environmental Challenges 11, 100708",
        "A. Mayuri, V. Rashmi, B. Das, A. Mandal and S. Neelakandan, 'Artificial Neural Network (ANN) With Chan-Vese(CV) Algorithm-Based Plant Disease Detection And Classification,' 2023 International Conference on Applied Intelligence and Sustainable Computing (ICAISC), Dharwad, India, 2023, pp. 1-6, doi: 10.1109/ICAISC58445.2023.10199472.",
        "S. Neelakandan, M. B. Varma, K. S. Reddy and N. Y. Reddy, 'Forecasting Electricity Price using Convolutional Neural Networks with Chicken Swarm Optimization Algorithm,' 2023 International Conference on Applied Intelligence and Sustainable Computing (ICAISC), Dharwad, India, 2023, pp. 1-7, doi: 10.1109/ICAISC58445.2023.10200868.",
        "S. Neelakandan, V. Prakash, M. S. PranavKumar and R. Balasubramaniam, 'Forecasting of E-Commerce System for Sale Prediction Using Deep Learning Modified Neural Networks,' 2023 International Conference on Applied Intelligence and Sustainable Computing (ICAISC), Dharwad, India, 2023, pp. 1-5, doi: 10.1109/ICAISC58445.2023.10199817.",
        "S. Neelakandan, P. Rajesh, P. Mahesh, P. Karthik and M. Mukesh, 'An Efficient WBC Cancer Cells Prediction Using Dense Net Algorithm,' 2023 International Conference on Applied Intelligence and Sustainable Computing (ICAISC), Dharwad, India, 2023, pp. 1-6, doi: 10.1109/ICAISC58445.2023.10199502.",
        "S. Neelakandan, A. Brinda, S. Dheekshitha and M. S. Divya Priya, 'Extreme Gradient Boosting based Fetal Health Classification,' 2023 International Conference on Applied Intelligence and Sustainable Computing (ICAISC), Dharwad, India, 2023, pp. 1-6, doi: 10.1109/ICAISC58445.2023.10200526."
    ]
}